
/*
 1. pwd -> 현재 터미널이 위치한 디렉토리 경로

 2. ls -> 현재 디렉토리의 파일/폴더 목록 보기
 2.1 ls 폴더명 -> 폴더명의 파일/폴더 목록 보기
 2.2 ls -l
 drwxr-xr-x 1 leehj 197121 0 Aug  6 10:10 00/     
 맨 앞글자 d -> 디렉토리 아니면 파일 
 2.3 ls -a -> 숨긴 폴더나 파일도 볼 수 있다.

 3. rm -> 폴더나 파일을 지울 수 있음
 3.1 rm 파일명/폴더명
 3.1.1 rm -rf 파일명/폴더명
 3.1.2 rm -rf ./03
 3.1.3 rm -rf 03
 3.1.4 rm -rf 03/1.js
 3.1.5 rm -rf 03/*
 3.1.6 rm -rf ./* 주의!!!
 3.1.7 rm -rf /*  주의!!!!!!

 4. cd
 4.1 cd 폴더명
 4.2 cd ..
 4.3 cd ../01 -> 상위 폴더의 01 폴더로 이동해라

 5. mkdir -> 폴더 만들기
 5.1 mkdir test -> test 폴더가 만들어짐

 6. touch 파일 만들기
 6.1 touch test.ts

 7. clear -> 파미널 명령어를 정리하는 것

 8. 화살표 위/아래 -> 이전 명령어

 9. tab -> 자동완성
 */