/* 

0. ./ -> 현재 폴더
00. ../ -> 상위 폴더

1. pwd -> 현재 터미널이 위치한 디렉토리 경로

2. ls -> 현재 디렉토리의 파일/폴더 목록 보기
2.1 ls 폴더명 -> 폴더명의 파일/폴더 목록 보기
2.2 ls -l -> 폴더 상세 정보
2.3 ls -a 숨겨져있는 파일
2.3.1 ls -la 숨겨져있는 파일까지 폴더 상세 정보 확인 가능

3. rm -> 폴더/파일 지우기
3.1 rm 파일명/폴더명
3.1.1 rm -rf 파일명/폴더명 -> 강제로 삭제

4. cd -> 폴더 이동
4.1 cd 폴더명
4.2 cd .. 상위 폴더로 이동
4.3 cd ../../.. 상위폴더의 상위폴더의 상위폴더로 이동

5. mkdir 폴더 만들기
5.1 mkdir test -> test 폴더 만들기

6. touch 파일 만들기
6.1 touch test.js -> test.js 파일 만들기

7. clear -> 터미널 명령어 정리 (깨끗하게)

8. 화살표 위/아래 -> 이전 명령어 가져오기
9. 일부분만 입력 후 tab키 -> 자동완성

*/
