/*
    ./ -> 현재 폴더
    ../ -> 상위 폴더
    ../../ -> 상위 폴더의 상위 폴더

    1. pwd -> 현재 터미널이 위치한 디렉토리 경로
    2. ls -> 현재 디렉토리의 파일/폴더 목록 보기
        ㄴ ls 폴더명 -> 해당 폴더의 파일/폴더 목록 보기
            ㄴ ls -l -> 맨 앞글자가 d면 폴더, 맨 앞글자가 -면 파일
            ㄴ ls -a -> 숨겨져 있는 파일을 보여줌
            ㄴ ls -la -> l과 a를 합친 기능*
    3. rm -> 폴더나 파일을 지울 수 있음
        ㄴ rm 파일명/폴더명
        ㄴ rm -rf 파일명/폴더명 -> 경고를 무시하고 삭제 가능
        ㄴ rm -rf /* -> 쓰면 회사 짤림
    4. cd -> 폴더 변경
        ㄴ cd .. -> 상위 폴더로 이동
    5. mkdir -> 폴더 생성
    6. touch -> 파일 생성
    7. clear -> 터미널 명령어 정리

*/
