/*

0. ./ -> 현재 폴더
0. ../ -> 상위 폴더

1. pwd -> 현재 터미널이 위치한 디렉터리 경로

2. ls (list) -> 현재 디렉터리의 파일/폴더 목록 보기
2.1 ls 폴더명 -> 폴더명의 파일/폴더 목록 보기
2.2 ls -l (d는 폴더, - 파일)
2.3 ls -a -> 숨긴 폴더나 파일도 보기 가능

3. rm (remove) -> 폴더나 파일을 지울 수 있음
3.1 rm 파일명
3.1.1 rm -rf 파일명/폴더명

4. cd (change directory)
4.1 cd 폴더명 -> 폴더명 폴더로 이동
4.1 cd .. -> 상위 폴더로 이동

5. mkdir (make directory) 폴더 만들기
5.1 mkdir test -> test 폴더가 만들어짐

6. touch -> 파일 만들기
6.1 touch test.ts

7. clear -> 터미널 명령어를 정리하는 것

8. 화살표 위/아래

9. 일부분만 입력하고 tab키 -> 자동완성

*/
